In [ ]:
import pandas as pd
link_df = "https://raw.githubusercontent.com/selva86/datasets/master/wineind.csv" #dataset tentang penjualan wine dari tahun per tahun
df = pd.read_csv(link_df)
df.head()

         date  winesales
0  1980-01-01      15136
1  1980-02-01      16733
2  1980-03-01      20016
3  1980-04-01      17708
4  1980-05-01      18019

In [ ]:
## CREATE A FUNCTION CLOSURE THAT FOR FEATURE ENGINEERING OF A DATASET
## THE FUNCTION WILL TAKE A DATASET AND RETURN A NEW DATASET WITH THE FOLLOWING FEATURES


def feature_engineering_tranfrom(
    operation,
):  # fungsi closure yang akan mengembalikan fungsi baru yang akan melakukan operasi feature engineering pada dataset
    """
    membuat fungsi closure yang akan melakukan feature engineering pada dataset yang diberikan

    Parameters:
    operation (function): fungsi yang akan diterapkan pada setiap elemen dalam dataset

    Returns:
    function: fungsi yang akan melakukan operasi feature engineering pada dataset yang diberikan
    """

    def transform(
        data,
    ):  # fungsi yang akan melakukan operasi feature engineering pada dataset yang diberikan
        """
        melakukan operasi feature engineering pada dataset yang diberikan

        Parameters:
        data (list): dataset yang akan diubah

        Returns:
        list: dataset yang telah diubah
        """

        return [operation(x) for x in data]

    return transform

In [ ]:
standardize = feature_engineering_tranfrom(
    lambda x: (x - df["winesales"].mean()) / df["winesales"].std()
)  # fungsi yang akan melakukan standardisasi pada dataset
normalize = feature_engineering_tranfrom(
    lambda x: (x - df["winesales"].min())
    / (df["winesales"].max() - df["winesales"].min())
)  # fungsi yang akan melakukan normalisasi pada dataset


df["winesales_standardized"] = standardize(
    df["winesales"]
)  # menambahkan kolom baru yang berisi data yang telah distandardisasi
df["winesales_normalized"] = normalize(
    df["winesales"]
)  # menambahkan kolom baru yang berisi data yang telah dinormalisasi
df.head()

         date    winesales  winesales_standardized  winesales_normalized
0  1980-01-01  15136000000               -1.920331              0.055844
1  1980-02-01  16733000000               -1.621314              0.115940
2  1980-03-01  20016000000               -1.006614              0.239482
3  1980-04-01  17708000000               -1.438758              0.152630
4  1980-05-01  18019000000               -1.380527              0.164334